app/controllers/pages_controller.rb

SELECT * FROM `sensor` WHERE (`sensor`.`sid` = 2) LIMIT 1
SELECT * FROM `event` ORDER BY timestamp DESC LIMIT 20
SELECT * FROM `signature` WHERE (`signature`.`sig_id` = 1) LIMIT 1
SELECT * FROM `tcphdr`
---
  def welcome
    @sensor = Sensor.all
    @event = Event.all :order => 'timestamp DESC', :limit => '20'
    @signature = Signature.all
    @tcp = Tcphdr.all